
# special_notifi.py
# this script created to display notification box on windows 10.
# with a spacific message that you can automate it to reminds you of scheduled tasks.
# The first time I programmed it was a reminder to pray for my deceased friend, I hope he's in a better place now.
# now lets coding.

import os
import time
import sys
import getpass
from random import randint


try:
    # try to import external modules.

    # win10toast that control the windows10 notifications.
    from win10toast import ToastNotifier

    # apscheduler controling the scheduling tasks in this script.
    from apscheduler.schedulers.blocking import BlockingScheduler
except:

    # exception for any missing module.
    # try to install modules
    print("[+] Missing libraries installation. . .")
    print("Installing win10toast")
    os.system("pip install win10toast")
    print("Installing apscheduler")
    os.system("pip install apscheduler")
    os.system("cls")


# the azkar and ayat list/array.
# you can change them as you like.
ayat_and_azkar = [
        "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ * وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "وَأَمّا مَن خافَ مَقامَ رَبِّهِ وَنَهَى النَّفسَ عَنِ الهَوى * فَإِنَّ الجَنَّةَ هِيَ المَأوى",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
        "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
        "استغفر الله العظيم واتوب اليه",
        "إِذ يَقولُ لِصاحِبِهِ لا تَحزَن إِنَّ اللَّهَ مَعَنا فَأَنزَلَ اللَّهُ سَكينَتَهُ عَلَيهِ",
        "وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ أَوْلِيَاءَ ثُمَّ لَا تُنْصَرُونَ",
        "قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
        "وَاذْكُرْ رَبَّكَ كَثِيرًا",
        "عَسَى رَبُّنَا أَن يُبْدِلَنَا خَيْرًا مِّنْهَا إِنَّا إِلَى رَبِّنَا رَاغِبُونَ",
        "وَاصبِر عَلى ما أَصابَكَ إِنَّ ذلِكَ مِن عَزمِ الأُمورِ",
        "سُبْحَانَكَ تُبْتُ إِلَيْكَ",
        "اللهم احسن خاتمتنا",
        "اللهم احسن خاتمتنا",
        "استغفر الله العظيم واتوب اليه",
        "اللهم احسن خاتمتنا",
        "لا تَخَف وَلا تَحزَن إِنّا مُنَجّوكَ",
        "قُل يا عِبَادِيِ الذيْنَ أَسْرَفُوْا عَـلى أنْفَسِهم لا تَقْنَطوْا من رَحْمَةِ اللّهِ إنّ اللّهَ يَغفِرُ الذُنوبَ جَميعَاً",
        "وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمَْ",
        "اللهم احسن خاتمتنا",
        "اللهم احسن خاتمتنا",
        "فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ",
        "وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
        "إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ * فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ",
        "وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلاَ كَاشِفَ لَهُ إِلاَّ هُوَ وَإِن يَمْسَسْكَ بِخَيْرٍ فَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ"
        "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
        "وَمَن يَتَّقِ اللَّهَ يَجعَل لَهُ مِن أَمرِهِ يُسرًا",
        "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ",
        "وَاستَغفِروا رَبَّكُم ثُمَّ توبوا إِلَيهِ إِنَّ رَبّي رَحيمٌ وَدودٌ",
        "رَبِّ اشْرَحْ لِي صَدْرِي",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم تغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ * وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ * لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ * تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ * سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ",
        "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "وَإِن تَعُدُّواْ نِعْمَةَ اللَّهِ لاَ تُحْصُوهَا",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ",
        "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيم",
        "يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ * الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ * فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ",
        "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "اهدِنَا الصِّراطَ المُستَقيمَ",
        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا ۖ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
        "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ ۚ وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ ۗ إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ",
        "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ",
        "وَاتَّقُوا يَوْمًا لَا تَجْزِي نَفْسٌ عَنْ نَفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَلَا هُمْ يُنْصَرُونَ",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "الحمد لله حمداً كثيراً طيباً مباركاً فيه",
        "رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي",
        "لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِمَنْ كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا",
        "إِذ يَقولُ لِصاحِبِهِ لا تَحزَن إِنَّ اللَّهَ مَعَنا فَأَنزَلَ اللَّهُ سَكينَتَهُ عَلَيهِ",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
        "لا حول ولا قوة الا بالله العلي العظيم",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا",
        "سبحان الله العظيم",
        "تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
        "لا حول ولا قوة الا بالله العلي العظيم",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا",
        "فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ",
        "قُل يا عِبَادِيِ الذيْنَ أَسْرَفُوْا عَـلى أنْفَسِهم لا تَقْنَطوْا من رَحْمَةِ اللّهِ إنّ اللّهَ يَغفِرُ الذُنوبَ جَميعَاً",
        "عَسى رَبُّنا أَن يُبدِلَنا خَيرًا مِنها إِنّا إِلى رَبِّنا راغِبونَ",
        "وَإِن تَعُدُّواْ نِعْمَةَ اللَّهِ لاَ تُحْصُوهَا",
        "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "سبحان الله العظيم",
        "لا تَخَف وَلا تَحزَن إِنّا مُنَجّوكَ",
        "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِي مُؤْمِناً وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا",
        "لا حول ولا قوة الا بالله العلي العظيم",
        "سبحان الله العظيم",
        "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
        "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ * وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ"
        "استغفر الله العظيم واتوب اليه",
        "الحمد لله حمداً كثيراً طيباً مباركاً فيه",
        "الله اكبر",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين"]



def main():

    # get the time period from the user.
    time_period = int(input("Enter time period in seconds: "))

    # display the notification for the first time
    start()

    # take an object from BlockingScheduler class
    scheduler = BlockingScheduler()
    # 
    scheduler.add_job(start,                        # action to do.
                      'interval',                   # default value
                       minutes=time_period)         # set the period to time_period value.
    scheduler.start()

# get zekr from ayat_and_azkar list.
def get_zekr(azkar_list):

    # get the numer of azakr.
    size = len(azkar_list)
    # get a random index.
    index = randint(0,size)
    # get the index value.
    zekr = azkar_list[index]
    # return zekr value.
    return zekr


# display azkar on the screen
def win10_display_notification(zekr):

    # take an object from the ToastNotifier class
    toaster = ToastNotifier()

    # notification content here
    toaster.show_toast("Sadaqah Notification !", # notification title.
                        zekr,                    # notification content
                        duration = 10)           # notification display period to 10 seconds


def start():
    
    # pass ayat_and_azkar list to get a random zekr as we mention before.
    zekr = get_zekr(ayat_and_azkar)
    # display the notification with zekr avr value
    win10_display_notification(zekr)



# if you want to run script on startup automaticlly.
# you can copy the script to this path: 'C:\\Users\\%s\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup' %user_name
# but modify the code first.

main()