#!/usr/bin/env python

import os
import time
import sys
import getpass


'''
    Author@Sadaqah-Script~$ --Message

        In The Name Of Allah,
        Allah Bless Your Soul My Dear Friend Youssef.

        We May Not Be Friends Or Didn't Talk To Each Others Before.
        I Don't Hide That I Think I'M Lucky For That, Do You Know Why?
        Although We Don'T Know Each Other, Something Strange Inside Of Me Pushed Me
        To Continue Writing This Script.

        I Don't Know What Is This Thing That Motivated Me To Do This Even Though
        It Is Not My Habits To Persevere To This Extent.
        I Think It'S Your Friends' Love For You That Motivated Me To Do That.
        You Are So Lucky That All Of These People Love You Even If They Don'T Know You.

        Even I Love You Dear,
        I Loved You From Their Words About You And Their Love For You.
        I Love You Without Knowing Or Talking To You, So How Am I If I Know You ?
        I Think I Could Not Afford To Lose You, My Friend.

        But Look At The Positive Side, I Think You Are Now In A Better Place.
        And All We Can Do Now Is Dua For You.
        Allah Bless Your Soul My Dear Friend Youssef Saber, Allah Bless Your Soul .
        Good Bye My Friend.

        - The Author : Hossam Hamdy
'''
Source_Code = """
from win10toast import ToastNotifier
from apscheduler.schedulers.blocking import BlockingScheduler
from random import randint

val = 60    #change it [1] as you like


ayat_and_azkar = [

        "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ * وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "وَأَمّا مَن خافَ مَقامَ رَبِّهِ وَنَهَى النَّفسَ عَنِ الهَوى * فَإِنَّ الجَنَّةَ هِيَ المَأوى",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
        "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
        "استغفر الله العظيم واتوب اليه",
        "إِذ يَقولُ لِصاحِبِهِ لا تَحزَن إِنَّ اللَّهَ مَعَنا فَأَنزَلَ اللَّهُ سَكينَتَهُ عَلَيهِ",
        "وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ أَوْلِيَاءَ ثُمَّ لَا تُنْصَرُونَ",
        "قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
        "وَاذْكُرْ رَبَّكَ كَثِيرًا",
        "عَسَى رَبُّنَا أَن يُبْدِلَنَا خَيْرًا مِّنْهَا إِنَّا إِلَى رَبِّنَا رَاغِبُونَ",
        "وَاصبِر عَلى ما أَصابَكَ إِنَّ ذلِكَ مِن عَزمِ الأُمورِ",
        "سُبْحَانَكَ تُبْتُ إِلَيْكَ",
        "اللهم احسن خاتمتنا",
        "اللهم احسن خاتمتنا",
        "استغفر الله العظيم واتوب اليه",
        "اللهم احسن خاتمتنا",
        "لا تَخَف وَلا تَحزَن إِنّا مُنَجّوكَ",
        "قُل يا عِبَادِيِ الذيْنَ أَسْرَفُوْا عَـلى أنْفَسِهم لا تَقْنَطوْا من رَحْمَةِ اللّهِ إنّ اللّهَ يَغفِرُ الذُنوبَ جَميعَاً",
        "وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمَْ",
        "اللهم احسن خاتمتنا",
        "اللهم احسن خاتمتنا",
        "فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ",
        "وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
        "إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ * فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ",
        "وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلاَ كَاشِفَ لَهُ إِلاَّ هُوَ وَإِن يَمْسَسْكَ بِخَيْرٍ فَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ"
        "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
        "وَمَن يَتَّقِ اللَّهَ يَجعَل لَهُ مِن أَمرِهِ يُسرًا",
        "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ",
        "وَاستَغفِروا رَبَّكُم ثُمَّ توبوا إِلَيهِ إِنَّ رَبّي رَحيمٌ وَدودٌ",
        "رَبِّ اشْرَحْ لِي صَدْرِي",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم تغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ * وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ * لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ * تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ * سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ",
        "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "وَإِن تَعُدُّواْ نِعْمَةَ اللَّهِ لاَ تُحْصُوهَا",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ",
        "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيم",
        "يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ * الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ * فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ",
        "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "اهدِنَا الصِّراطَ المُستَقيمَ",
        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا ۖ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
        "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ ۚ وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ ۗ إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ",
        "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ",
        "وَاتَّقُوا يَوْمًا لَا تَجْزِي نَفْسٌ عَنْ نَفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَلَا هُمْ يُنْصَرُونَ",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "الحمد لله حمداً كثيراً طيباً مباركاً فيه",
        "رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي",
        "لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِمَنْ كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا",
        "إِذ يَقولُ لِصاحِبِهِ لا تَحزَن إِنَّ اللَّهَ مَعَنا فَأَنزَلَ اللَّهُ سَكينَتَهُ عَلَيهِ",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",
        "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
        "لا حول ولا قوة الا بالله العلي العظيم",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا",
        "سبحان الله العظيم",
        "تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
        "لا حول ولا قوة الا بالله العلي العظيم",
        "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا",
        "فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ",
        "قُل يا عِبَادِيِ الذيْنَ أَسْرَفُوْا عَـلى أنْفَسِهم لا تَقْنَطوْا من رَحْمَةِ اللّهِ إنّ اللّهَ يَغفِرُ الذُنوبَ جَميعَاً",
        "عَسى رَبُّنا أَن يُبدِلَنا خَيرًا مِنها إِنّا إِلى رَبِّنا راغِبونَ",
        "وَإِن تَعُدُّواْ نِعْمَةَ اللَّهِ لاَ تُحْصُوهَا",
        "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "سبحان الله العظيم",
        "لا تَخَف وَلا تَحزَن إِنّا مُنَجّوكَ",
        "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِي مُؤْمِناً وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا",
        "لا حول ولا قوة الا بالله العلي العظيم",
        "سبحان الله العظيم",
        "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
        "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ * وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ"
        "استغفر الله العظيم واتوب اليه",
        "الحمد لله حمداً كثيراً طيباً مباركاً فيه",
        "الله اكبر",
        "اللهم صلي وسلم وبارك علي سيدنا محمد",
        "اللهم اغفر لصديقنا يوسف صابر وادخله يارب فسيح جناته",
        "اللهم اغفر للمؤمنين والمؤمنات الاحياء منهم والاموات انك سميع قريب مجيب الدعوات يا ارحم الراحمين",]



def get_zekr(zekr_list):
  size = len(zekr_list)-1
  index = randint(0,size)
  zekr = zekr_list[index]
  return zekr

def display_notification(zekr):
    toaster = ToastNotifier()
    msg = f"{zekr}"

    toaster.show_toast("Sadaqah Notification !",msg,duration=15)

def start():
    x = get_zekr(ayat_and_azkar)
    display_notification(x)

start()
scheduler = BlockingScheduler()
scheduler.add_job(start, 'interval', minutes=val)
scheduler.start()
"""

def creat_startup(source):

	user_name = getpass.getuser()
	folder_path= 'C:\\Users\\%s\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup' %user_name

	check = os.path.exists(folder_path)
	if check:
		print("\n\nStartup File Has Been Found !\n")

		with open(f"{folder_path}\\Sadaqah Script.pyw",'w') as final_file:
			final_file.write(source)

		test_check = os.path.isfile(f"{folder_path}\\Sadaqah Script.pyw")
		print("\n\n[ Check File in Path ! ]\n")
		if test_check:
			time.sleep(2)
			print("Sadaqah Script Is In The Path !")
		else:
			print("Something Went Wrong !")
			print("Mail Author @    [ m3t4n0y3t@gmail.com ]")
	else:
		print("Startup Folder Doesn't Exist !")
		print("Try To Search Online About How To Access The Startup Folder\nAnd Then Change it's Value In Line 169")

intro = """
        Sadaqah Script : Is A Free Open Source Script.
        That Coded As A Kind Of Sadaqah For Our Dear Friend Youssef Saber.
        You Can Use It For Any Other Purpose, But Even If You Use It For It Is Not
        Main Purpose Please Remember To Ask Allah For Bleesing Youssef'S Saber Soul.
           _____           _                   _         _____           _       _
          / ____|         | |                 | |       / ____|         (_)     | |
         | (___   __ _  __| | __ _  __ _  __ _| |__    | (___   ___ _ __ _ _ __ | |_
          \___ \ / _` |/ _` |/ _` |/ _` |/ _` | '_ \    \___ \ / __| '__| | '_ \| __|
          ____) | (_| | (_| | (_| | (_| | (_| | | | |   ____) | (__| |  | | |_) | |_
         |_____/ \__,_|\__,_|\__,_|\__, |\__,_|_| |_|  |_____/ \___|_|  |_| .__/ \__|
                                      | |                                 | | Python 3.8.1
                                      |_|                                 |_| Author : Hossam Hamdy\n\n
          Hello My Dear , The Installation Will Take Only Seconds\n
          """
print(intro)

command = str(input("[?] Do you want to install the script? [Y/N] : ")).lower()
while command == '':
	command = str(input("[?] Do you want to install the script? [Y/N] : ")).lower()

if command == 'y':
	os.system('cmd /c "pip install win10toast"')
	os.system('cmd /c "pip install apscheduler"')
	creat_startup(Source_Code)
	print("\nRemember To Ask Allah For Bleesing Youssef'S Saber Soul.")
	time.sleep(2)
	while True:
		e = str(input("\nPress Any Key To Exit .... "))
		while e != '':
			e = str(input("Press Any Key To Exit .... "))
		if e == '':
			sys.exit()
		else:
			continue

else:
	print("\nThe Script Will Close After 3 Seconds")
	time.sleep(1)
	print("\nRemember To Ask Allah For Bleesing Youssef'S Saber Soul.")
	time.sleep(3)

os.system("pause")
